In [1]:
import csv
import pandas as pd
from sqlalchemy import create_engine

In [2]:
income1 = pd.read_csv('https://usc.data.socrata.com/api/views/kygc-fzgm/rows.csv?accessType=DOWNLOAD')
income1.head()

,Policy Area,Dataset,Variable,Year,Amount,Tract,Tract Number,Neighborhood,GEOID,Location,Row ID,Date
0,Employment & Income,Income,Median Household Income,2013,74971.0,"Census Tract 4321.01, Los Angeles County, Cali...",432101,Temple City,1400000US06037432101,"(34.095852, -118.0428825)",Median_Household_Income_2013_1400000US06037432101,01/01/2013
1,Employment & Income,Income,Median Household Income,2013,30759.0,"Census Tract 2422, Los Angeles County, California",242200,Watts,1400000US06037242200,"(33.948204, -118.238625)",Median_Household_Income_2013_1400000US06037242200,01/01/2013
2,Employment & Income,Income,Median Household Income,2011,57219.0,"Census Tract 2719.02, Los Angeles County, Cali...",271902,Mar Vista,1400000US06037271902,"(34.009731, -118.4316705)",Median_Household_Income_2011_1400000US06037271902,01/01/2011
3,Employment & Income,Income,Median Household Income,2013,81700.0,"Census Tract 4313, Los Angeles County, California",431300,Mayflower Village,1400000US06037431300,"(34.1248395, -118.007363)",Median_Household_Income_2013_1400000US06037431300,01/01/2013
4,Employment & Income,Income,Median Household Income,2011,101783.0,"Census Tract 4805, Los Angeles County, California",480500,South Pasadena,1400000US06037480500,"(34.1074225, -118.14498)",Median_Household_Income_2011_1400000US06037480500,01/01/2011

### Extract CSVs into DataFrames

In [12]:
income = income1[["Neighborhood", "Tract Number",]].copy()
income.head()

        Neighborhood  Tract Number
0        Temple City        432101
1              Watts        242200
2          Mar Vista        271902
3  Mayflower Village        431300
4     South Pasadena        480500

In [14]:
income.index.names = ['id']
income.head()

         Neighborhood  Tract Number
id
0         Temple City        432101
1               Watts        242200
2           Mar Vista        271902
3   Mayflower Village        431300
4      South Pasadena        480500

In [15]:
income.index = income.index + 1
income.head()

         Neighborhood  Tract Number
id
1         Temple City        432101
2               Watts        242200
3           Mar Vista        271902
4   Mayflower Village        431300
5      South Pasadena        480500

In [19]:
income = income.rename(columns={"Neighborhood":"name", "Tract Number":"tract_id"})
income.head()

                 name  tract_id
id
1         Temple City    432101
2               Watts    242200
3           Mar Vista    271902
4   Mayflower Village    431300
5      South Pasadena    480500

### Transform premise DataFrame

### Transform county DataFrame

### Create database connection

In [20]:
connection_string = "root:root@localhost/neighborhoods"
engine = create_engine(f'mysql+pymysql://{connection_string}')

In [21]:
# Confirm tables that are created in the database 
engine.table_names()

['neighborhoods']

### Load DataFrames into database

In [23]:
#Use pandas to load csv converted DataFrame into database
income.to_sql(name='neighborhoods', con=engine, if_exists='append', index=False)

In [24]:
#Confirm data has been added by querying the median_household_income table
pd.read_sql_query('select * from neighborhoods', con=engine).head()

   id               name  tract_id
0   1        Temple City    432101
1   2              Watts    242200
2   3          Mar Vista    271902
3   4  Mayflower Village    431300
4   5     South Pasadena    480500